# Create Method (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ZoneEquipment..::..Create Method
ZoneEquipment Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String) | Creates a new zone equipment |
| Create(Document, AnalyticalSystemDomain, String) | **Obsolete.** Creates a new zone equipment |

# See Also
ZoneEquipment Class
ZoneEquipment Members
Autodesk.Revit.DB.Mechanical Namespace